БухЭксп/Catalogs/CW_КонтактыеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_КонтактыеЛица</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Неактивный</Name>
					<Comment>Уволен (не действует)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_КонтактыеЛица/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	_УФС.ОтключитьИсториюВыбораЭлементовФормы(ЭтаФорма);
	// --- 
	_УправлениеЭлементамиФормы();
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОповеститьОЗаписиНового(Объект.Ссылка);
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура _УправлениеЭлементамиФормы()
	// --- 
	
	Элементы.ГруппаСоздатьФизЛицо.Видимость = (Объект.ФизическоеЛицо.Пустая());
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура СоздатьФизЛицо(Команда)
	
	РедактированиеЗапрещено  = ПроверитьРазрешения();
	
	Если Не РедактированиеЗапрещено Тогда
		ПОВ = Новый ОписаниеОповещения("ОбработкаВводаДанныхФизическогоЛица",ЭтотОбъект); 
		ОткрытьФорму("Справочник.CW_КонтактыеЛица.Форма.ФормаСозданияФизическогоЛица",,,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ПоказатьПредупреждение(, "Недостаточно прав для данного действия.");
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ПроверитьРазрешения()
	
	Возврат РегистрыСведений.CW_ДоступныеСправочникиПоГруппамПользователей.РедактированиеОбъектаЗапрещено(Тип("СправочникСсылка.ФизическиеЛица"));
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВводаДанныхФизическогоЛица(Ответ, ДополнительныеПараметры ) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Результат = _СоздатьФизЛицо(Ответ);
		Если (НЕ _УФКС.ВыполненоУспешно(Результат)) Тогда
			
			_УФК.ВывестиПредупреждение(_УФКС.ПредставлениеОшибки(Результат));
			
		КонецЕсли; 
		_УправлениеЭлементамиФормы();
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _СоздатьФизЛицо(СтруктураФЛ)
	// --- 
	
	НФЛ = Справочники.ФизическиеЛица.СоздатьЭлемент();
	НФЛ.Наименование = ?(ЗначениеЗаполнено(СтруктураФЛ.Фамилия),СокрЛП(СтруктураФЛ.Фамилия),"")
	+?(ЗначениеЗаполнено(СтруктураФЛ.Имя)," "+СокрЛП(СтруктураФЛ.Имя),"")
	+?(ЗначениеЗаполнено(СтруктураФЛ.Отчество)," "+СокрЛП(СтруктураФЛ.Отчество),"");
	НФЛ.ФИО = НФЛ.Наименование;
	
	
	Попытка
		
		НФЛ.Записать();
		Объект.ФизическоеЛицо = НФЛ.Ссылка;
		
		УстановитьПривилегированныйРежим(Истина);
		
		Запись = РегистрыСведений.ФИОФизическихЛиц.СоздатьМенеджерЗаписи();
		// --- 
		Запись.Период = ТекущаяДата();
		Запись.ФизическоеЛицо = Объект.ФизическоеЛицо;
		Запись.Фамилия = СтруктураФЛ.Фамилия;
		Запись.Имя = СтруктураФЛ.Имя;
		Запись.Отчество = СтруктураФЛ.Отчество;
		// --- 
		Запись.Записать();
		
	Исключение
		Возврат(_УФКС.Ответ(1,ОписаниеОшибки()));
	КонецПопытки; 
	
	Возврат(_УФКС.Ответ());
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ДолжностьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораДолжности",ЭтотОбъект, Новый Структура()); 
	ОткрытьФорму("Справочник.Должности.ФормаВыбора",Новый Структура("РежимВыбора",Истина),ЭтаФорма,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораДолжности(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Объект.Должность = Строка(Ответ);
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ФизическоеЛицоПриИзменении(Элемент)
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура РодительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	// --- 
	ПФ = Новый Структура("Контрагент", Объект.Владелец);
	ОткрытьФорму("Справочник.CW_КонтактыеЛица.ФормаВыбораГруппы",ПФ,Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура КонтрагентОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	// --- 
	ПФ = Новый Структура("Ключ",Объект.Владелец);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаКонтактнойИнформации",ПФ,Элемент,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ФизическоеЛицоОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	// --- 
	ПФ = Новый Структура("Ключ",Объект.ФизическоеЛицо);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаКонтактнойИнформации",ПФ,Элемент,Истина);	
	
КонецПроцедуры
  

// ---------------------------------------------------------------------------- 


#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти
